**SQL JOINS**


**Types of Joins**

There are mainly four types of joins that we'll need to understand



*   Inner Join
*   Full Join 
*   Left Join
*   Right Join

Let's explore each of them individually

**Connecting Our Database**

In [1]:
# We will first load an sql extension into our environment
# This extension will allow us to work with sql on Colaboratory
#
%load_ext sql

# We will then connect to our in memory sqlite database
# NB: This database will cease to exist as soon as the database connection is closed.
# We will learn more about how databases are created later in prep.
#
%sql sqlite://

In [3]:
%%sql
--- # Before we start to look at each type of Join, let's start by creating the tables that we'll use to perform the Join operations
CREATE TABLE Employee(
    EmpID int,
    EmplFname varchar(255),
    EmpLName varchar(255),
    Age int,
    EmailID varchar(255),
    PhoneNo int,
    Address varchar(255)
);

CREATE TABLE Project(
    ProjectId int,
    EmpID int,
    ClientID int,
    ProjectName varchar(255),
    ProjectStartDate varchar(255)

);

CREATE TABLE Client(
    ClientID int,
    ClientFname varchar(255),
    ClientLName varchar(255),
    Age int,
    ClientEmailID varchar(255),
    PhoneNo int,
    Address varchar(255),
    EmpID, int

);

 * sqlite://
Done.
Done.
Done.

[]

## Manipulate employee tables
    
    1. Add data 
    2. View data
    3. Manipulate data

In [8]:
%%sql
---# Now that we have created the tables, let's populate them.
INSERT INTO Employee
(EmpID, EmplFname,EmpLName,Age,EmailID,PhoneNo,Address)
VALUES 
(1,'Vardhan','Kumar',22,'vardy@abc.com',9876543210,'Delhi'),
(2,'Himani', 'Sharma',32,'himani@abc.com',9977554422,'Mumbai');

 * sqlite://
2 rows affected.

[]

In [9]:
%%sql
SELECT * FROM Employee;

 * sqlite://
Done.

[(1, 'Vardhan', 'Kumar', 22, 'vardy@abc.com', 9876543210, 'Delhi'),
 (2, 'Himani', 'Sharma', 32, 'himani@abc.com', 9977554422, 'Mumbai')]

In [11]:
%%sql
SELECT * FROM Employee
GROUP BY Age
HAVING Age > 20;

 * sqlite://
Done.

[(1, 'Vardhan', 'Kumar', 22, 'vardy@abc.com', 9876543210, 'Delhi'),
 (2, 'Himani', 'Sharma', 32, 'himani@abc.com', 9977554422, 'Mumbai')]

## Manipulate Projects tables

In [13]:
%%sql
-- # lets fill the other tables with data
INSERT INTO Project(ProjectId,EmpID,ClientID,ProjectName,ProjectStartDate)
VALUES
(1,2,5,"Testing SQL","12.12.2024");

 * sqlite://
1 rows affected.

[]

In [15]:
%%sql
SELECT * FROM Project;

 * sqlite://
Done.

[(1, 2, 5, 'Testing SQL', '12.12.2024')]